[
  {
    "bookName": "NGINX High Performance",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/nginx_high_performance.jpg",
    "datePublished": "2015",
    "numberOfPages": "168",
    "originDlLink": "http://filepi.com/i/AkSJgmV",
    "description": "NGINX is one of the most common free, open source web servers. Its performance-oriented architecture and small footprint makes it an ideal choice for high-traffic websites.\r\n\r\nNGINX offers great performance and optimal resource utilization to its administrators. This practical guide walks you through how to tune one of the leading free open source web servers to attain optimal performance for high-traffic sites. It also explores ways to improve network utilization for high loads.\r\n\r\nThe tour starts with an overview of the NGINX architecture. You will build and configure NGINX for optimal utilization of the hardware available. The book demonstrates various practices to improve last mile content delivery by using timeouts, caching, and compression. You'll also discover various free open source tools to test and benchmark web server performance, allowing you to verify NGINX performance at every step.",
    "originPageLink": "http://it-ebooks.info/book/6112",
    "index": 6112,
    "customBookName": "NGINX High Performance",
    "createTime": 1447145237865
  },
  {
    "bookName": "AngularJS Test-driven Development",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/angularjs_test-driven_development.jpg",
    "datePublished": "2015",
    "numberOfPages": "206",
    "originDlLink": "http://filepi.com/i/3Q3QVuz",
    "description": "Starting with reviewing the test-driven development (TDD) life cycle, you will learn how Karma and Protractor make your life easier while running JavaScript unit tests. You will learn how Protractor is different from Selenium and how to test it entirely. This book is a walk-through to using TDD to build an AngularJS application containing a controller, model, and scope.\r\n\r\nBuilding on the initial foundational aspects, you will expand to include testing for multiple controllers, partial views, location references, CSS, and the HTML element. In addition, you will explore using a headless browser with Karma. You will also configure Karma file watching to automate testing and tackle components of AngularJS (controller, service, model, and broadcasting) using TDD. At the end of this book, you will extend explore how to pull data using an external API, setting up and configuring Protractor to use a standalone Selenium server, and setting up Travis CI and Karma to test your application.",
    "originPageLink": "http://it-ebooks.info/book/4827",
    "index": 4827,
    "customBookName": "AngularJS Test Driven",
    "createTime": 1447145237872
  },
  {
    "bookName": "AngularJS: Up and Running",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/angularjs_up_and_running.jpg",
    "datePublished": "2014",
    "numberOfPages": "302",
    "originDlLink": "http://filepi.com/i/DdhuHkr",
    "description": "If want to get started with AngularJS, either as a side project, an additional tool, or for your main work, this practical guide teaches you how to use this meta-framework step-by-step, from the basics to advanced concepts. By the end of the book, you'll understand how to develop a large, maintainable, and performant application with AngularJS.\r\n\r\nGuided by two engineers who worked on AngularJS at Google, you'll learn the components needed to build data-driven applications, using declarative programming and the Model–view–controller pattern. You'll also learn how to conduct unit tests on each part of your application.",
    "originPageLink": "http://it-ebooks.info/book/3890",
    "index": 3890,
    "customBookName": "AngularJS Up And Running",
    "createTime": 1447145237881
  },
  {
    "bookName": "Pro CSS for High Traffic Websites",
    "postSrc": "http://it-ebooks.info/images/ebooks/6/pro_css_for_high_traffic_websites.jpg",
    "datePublished": "2011",
    "numberOfPages": "432",
    "originDlLink": "http://filepi.com/i/Q3SrM67",
    "description": "Although web standards-based websites can scale effectively - and basic CSS will give you basic results - there are considerations and obstacles that high traffic websites must face to keep your development and hosting costs to a minimum. There are many tips and tricks, as well as down-to-earth best practice information, to make sure that everything runs quickly and efficiently with the minimum amount of fuss or developer intervention. Targeted at \"high traffic\" websites - those receiving over 10,000 unique visitors a day - Pro CSS for High Traffic Websites gives you inside information from the professionals on how to get the most out of your web development team.  ",
    "originPageLink": "http://it-ebooks.info/book/5567",
    "index": 5567,
    "customBookName": "Pro CSS for High Traffic Websites",
    "createTime": 1447145238095
  },
  {
    "bookName": "Selectors, Specificity, and the Cascade",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/selectors_specificity_and_the_cascade.jpg",
    "datePublished": "2012",
    "numberOfPages": "86",
    "originDlLink": "http://filepi.com/i/a7GEkqb",
    "description": "Exactly how does the \"cascade\" in Cascading Style Sheets work? This concise guide demonstrates the power and simplicity of CSS selectors for applying style rules to different web page elements. You'll learn how your page's presentation depends on a multitude of style rules and the complex ways they function - and sometimes collide - within the document's structure.",
    "originPageLink": "http://it-ebooks.info/book/939",
    "index": 939,
    "customBookName": "Selectors Specificity and the Cascade",
    "createTime": 1447145238100
  },
  {
    "bookName": "Pro REST API Development with Node.js",
    "postSrc": "http://it-ebooks.info/images/ebooks/6/pro_rest_api_development_with_node.js.jpg",
    "datePublished": "2015",
    "numberOfPages": "196",
    "originDlLink": "http://filepi.com/i/ejkxaaY",
    "description": "Pro REST API Development with Node.js is your guide to managing and understanding the full capabilities of successful REST development. API design is a hot topic in the programming world, but not many resources exist for developers to really understand how you can leverage the advantages.\r\n\r\nThis book will provide a brief background on REST and the tools it provides (well known and not so well known). Understand how there is more to REST than just JSON and URLs. You will then cover and compare the maintained modules currently available in the npm community, including Express, Restify, Vatican, and Swagger. Finally you will code an example API from start to finish, using a subset of the tools covered.\r\n\r\nThe Node community is currently flooded with modules; some of them are published once and never updated again - cluttering the entire universe of packages. Pro REST API Development with Node.js shines light into that black hole of modules for the developers trying to create an API. Understand REST API development with Node.js using this book today.",
    "originPageLink": "http://it-ebooks.info/book/5826",
    "index": 5826,
    "customBookName": "Pro Rest API Development with NodeJS",
    "createTime": 1447145238677
  },
  {
    "bookName": "CSS Text",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/css_text.jpg",
    "datePublished": "2013",
    "numberOfPages": "56",
    "originDlLink": "http://filepi.com/i/vTVlJyR",
    "description": "As a web designer, you probably spend more time working with text than any other element. With this concise guide, you'll learn CSS3 properties for changing the appearance of text without altering the font face-including horizontal and vertical alignment, text transformation, word and letter spacing, text wrapping, and the direction of text flow.\r\n\r\nThis book is an excerpt from the upcoming fourth edition of CSS: The Definitive Guide. When you purchase either the print or the ebook edition of CSS Text, you'll receive a discount on the entire Definitive Guide once it's released.",
    "originPageLink": "http://it-ebooks.info/book/2886",
    "index": 2886,
    "customBookName": "CSS Text",
    "createTime": 1447145238898
  },
  {
    "bookName": "Beginning Responsive Web Design with HTML5 and CSS3",
    "postSrc": "http://it-ebooks.info/images/ebooks/6/beginning_responsive_web_design_with_html5_and_css3.jpg",
    "datePublished": "2014",
    "numberOfPages": "328",
    "originDlLink": "http://filepi.com/i/ewQfyBV",
    "description": "In Beginning Responsive Web Design with HTML5 and CSS3 you will learn about all aspects of responsive development. You'll start with media queries, and fluid CSS3 layouts. You'll see how to use responsive frameworks such as Twitter Bootstrap, and how to use tools such as Grunt, Bower, Sass, and LESS to help save you time. You'll also learn how to use JavaScript to manage responsive states, manage your user's journey across screen sizes, and optimize your responsive site. By the end of the book you will be able to build new sites responsively, and update existing sites to be responsive. Every aspect of a responsive build will be covered.",
    "originPageLink": "http://it-ebooks.info/book/3809",
    "index": 3809,
    "customBookName": "Beginning Responsive Web Design with HTML5 and CSS3",
    "createTime": 1447145238930
  },
  {
    "bookName": "Dependency Injection with AngularJS",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/dependency_injection_with_angularjs.jpg",
    "datePublished": "2013",
    "numberOfPages": "78",
    "originDlLink": "http://filepi.com/i/5hp98yp",
    "description": "Dependency injection facilitates better testing by allowing us to mock dependencies in testing environments so that we only test one thing at a time. It also enables us to write more maintainable code by decoupling our objects from their implementations. The motivation for using it in AngularJS is to make it easier to transparently load mocked objects in tests.\r\n\r\nThis book is a practical manual to get you started on dependency injection. It will also take you along the road to creating testable and reusable code. Ensuring productivity and stability are the two most important things that you will learn.\r\n\r\nDependency Injection with AngularJS will introduce you to AngularJS using a simple sample project. By portraying different ways of developing code modules, it will show you the advantages of dependency injection. This will lead to the ability to create reusable components that can easily be tested.",
    "originPageLink": "http://it-ebooks.info/book/3127",
    "index": 3127,
    "customBookName": "Dependency Injection with AngularJS",
    "createTime": 1447145238935
  },
  {
    "bookName": "CSS3 Foundations",
    "postSrc": "http://it-ebooks.info/images/ebooks/9/css3_foundations.jpg",
    "datePublished": "2013",
    "numberOfPages": "352",
    "originDlLink": "http://filepi.com/i/eDP5snZ",
    "description": "Html is fun when you're first learning how to use it to build a website. But when you add CSS (Cascading Style Sheets) to the mix, the experience—and your web pages—become magical. CSS3 Foundations takes you beyond the pre-fab themes and simple site-building tools found in most books, and provides you with the knowledge and tools you need to turn humdrum words and images into dazzling websites that draw visitors in and make them want to stay.\r\n\r\nLike all the books in the Treehouse series, CSS3 Foundations is designed to help you expand your skill set and broaden your professional horizons, whether you're a hobbyist looking to go pro, a freelancer who wants to expand your client base, or an entrepreneur who want to know how to create a website fully customized for your company and your market niche.",
    "originPageLink": "http://it-ebooks.info/book/3336",
    "index": 3336,
    "customBookName": "CSS3 Foundations",
    "createTime": 1447145239143
  },
  {
    "bookName": "CoffeeScript in Action",
    "postSrc": "http://it-ebooks.info/images/ebooks/5/coffeescript_in_action.jpg",
    "datePublished": "2014",
    "numberOfPages": "432",
    "originDlLink": "http://filepi.com/i/Fkg5rHu",
    "description": "JavaScript runs (almost) everywhere but it can be quirky and awkward. Its cousin CoffeeScript is easier to comprehend and compose. An expressive language, not unlike Ruby or Python, it compiles into standard JavaScript without modification and is a great choice for complex web applications. It runs in any JavaScript-enabled environment and is easy to use with Node.js and Rails.\r\n\r\nCoffeeScript in Action teaches you how, where, and why to use CoffeeScript. It immerses you in CoffeeScript's comfortable syntax before diving into the concepts and techniques you need in order to write elegant CoffeeScript programs. Throughout, you'll explore programming challenges that illustrate CoffeeScript's unique advantages. For language junkies, the book explains how CoffeeScript brings idioms from other languages into JavaScript.",
    "originPageLink": "http://it-ebooks.info/book/3788",
    "index": 3788,
    "customBookName": "CoffeeScript in Action",
    "createTime": 1447145239453
  },
  {
    "bookName": "You Don't Know JS: ES6 & Beyond",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/you_dont_know_js_es6__beyond_early_release.jpg",
    "datePublished": "2015",
    "numberOfPages": "272",
    "originDlLink": "http://filepi.com/i/nddhca9",
    "description": "No matter how much experience you have with JavaScript, odds are you don't fully understand the language. As part of the \"You Don't Know JS\" series, this compact guide focuses on the new features that will be available to developers in ECMAScript 6, the newest version of the standard on which JavaScript is built.\r\n\r\nLike other books in this series, You Don't Know JS: ES6 & Beyond dives into trickier parts of the language that many JavaScript programmers simply avoid. Armed with this knowledge, you can achieve true JavaScript mastery.",
    "originPageLink": "http://it-ebooks.info/book/6210",
    "index": 6210,
    "customBookName": "ES6 Beyond",
    "createTime": 1447145239672
  },
  {
    "bookName": "CSS Fonts",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/css_fonts.jpg",
    "datePublished": "2013",
    "numberOfPages": "68",
    "originDlLink": "http://filepi.com/i/6G2UkRZ",
    "description": "From custom fonts to ad-hoc font families you assemble out of a variety of individual faces, CSS 3 gives you more typographic options than ever before. This concise guide shows you how to use CSS properties to gain a fine-grained and wide-ranging influence over how you display fonts on the Web.\r\n\r\nShort and sweet, this book is an excerpt from the upcoming fourth edition of CSS: The Definitive Guide. When you purchase either the print or the ebook edition of Fonts, you'll receive a discount on the entire Definitive Guide once it's released. Why wait? Learn how to choose and manipulate fonts right away.",
    "originPageLink": "http://it-ebooks.info/book/2568",
    "index": 2568,
    "customBookName": "CSS Fonts",
    "createTime": 1447145239727
  },
  {
    "bookName": "HTML5 Canvas",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/html5_canvas.jpg",
    "datePublished": "2011",
    "numberOfPages": "652",
    "originDlLink": "http://filepi.com/i/uwCVDwS",
    "description": "No matter what platform or tools you use, the HTML5 revolution will soon change the way you build web applications, if it hasn't already. HTML5 is jam-packed with features, and there's a lot to learn. This book gets you started with the Canvas element, perhaps HTML5's most exciting feature. Learn how to build interactive multimedia applications using this element to draw, render text, manipulate images, and create animation.\r\n\r\nWhether you currently use Flash, Silverlight, or just HTML and JavaScript, you'll quickly pick up the basics. Practical examples show you how to create various games and entertainment applications with Canvas as you learn. Gain valuable experience with HTML5, and discover why leading application developers rave about this specification as the future of truly innovative web development.",
    "originPageLink": "http://it-ebooks.info/book/447",
    "index": 447,
    "customBookName": "HTML5 Canvas",
    "createTime": 1447145239978
  },
  {
    "bookName": "Learning React Native",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/learning_react_native_early_release.jpg",
    "datePublished": "2015",
    "numberOfPages": "200",
    "originDlLink": "http://filepi.com/i/ceIU2Kh",
    "description": "By bringing the advantages of ReactJS to mobile, React Native transforms every web developer into a potential mobile developer. Unlike existing JavaScript-for-mobile approaches, React Native actually renders natively, giving you the speed, look, and feel of a native mobile application.\r\n\r\nWith this practical book, web developers and frontend software engineers will learn how to use native UI elements, platform APIs (such as geolocation and local storage), and platform-specific design patterns to build high-quality mobile applications. This book focuses on iOS-based examples, but you'll leave armed with the principles necessary to use React Native effectively on all mobile platforms.",
    "originPageLink": "http://it-ebooks.info/book/6158",
    "index": 6158,
    "customBookName": "Learning React Native",
    "createTime": 1447145239986
  },
  {
    "bookName": "High Performance JavaScript",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/high_performance_javascript.jpg",
    "datePublished": "2010",
    "numberOfPages": "240",
    "originDlLink": "http://filepi.com/i/xWzoGmS",
    "description": "If you're like most developers, you rely heavily on JavaScript to build interactive and quick-responding web applications. The problem is that all of those lines of JavaScript code can slow down your apps. This book reveals techniques and strategies to help you eliminate performance bottlenecks during development. You'll learn optimal ways to load code onto a page, programming tips to help your JavaScript run as efficiently and quickly as possible, best practices to build and deploy your files to a production environment, and more.",
    "originPageLink": "http://it-ebooks.info/book/257",
    "index": 257,
    "customBookName": "High Performance JavaScript",
    "createTime": 1447145240260
  },
  {
    "bookName": "Extending Bootstrap",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/extending_bootstrap.jpg",
    "datePublished": "2014",
    "numberOfPages": "88",
    "originDlLink": "http://filepi.com/i/W1YRMey",
    "description": "Bootstrap is a free collection of tools used to create websites and web applications. It contains HTML- and CSS-based design templates for typography, forms, buttons, navigation and other interface components, as well as optional JavaScript extensions. Much has been written and said recently, in the world of web design and development, about Bootstrap. Some people call it a boon for web developers with little designing knowledge, while others call it a blessing for the designers. A user familiar with all that Bootstrap has to offer can extend the framework so that it no longer has the original look and feel of Twitter. This will allow you to use clever and novel ways of taking the power the standard library of Bootstrap has, and transform it into what you have envisioned.\r\n\r\nThis is a practical, step-by-step guide to extending Bootstrap. It covers all the aspects of extending Bootstrap, including themes, customization, extending its plugins, and an introduction to several third- party Bootstrap plugins.",
    "originPageLink": "http://it-ebooks.info/book/3512",
    "index": 3512,
    "customBookName": "Extending Bootstrap",
    "createTime": 1447145240271
  },
  {
    "bookName": "HTML5 Game Development by Example, 2nd Edition",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/html5_game_development_by_example_2nd_edition.jpg",
    "datePublished": "2015",
    "numberOfPages": "354",
    "originDlLink": "http://filepi.com/i/1WmWWRb",
    "description": "HTML5 is a markup language used to structure and present content for the World Wide Web and is a core technology of the Internet. It is supported across different platforms and is also supported by various browsers. Its innovative features, such as canvas, audio, and video elements, make it an excellent game building tool.\r\n\r\nHTML5 Game Development by Example Beginner's Guide 2nd Edition is a step-by-step tutorial that will help you create several games from scratch, with useful examples. Starting with an introduction to HTML5, the chapters of this book help you gain a better understanding of the various concepts and features of HTML5. By the end of the book, you'll have the knowledge, skills, and level of understanding you need to efficiently develop games over the network using HTML5.",
    "originPageLink": "http://it-ebooks.info/book/6023",
    "index": 6023,
    "customBookName": "HTML5 Game Development",
    "createTime": 1447145240523
  },
  {
    "bookName": "High Performance Browser Networking",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/high_performance_browser_networking.jpg",
    "datePublished": "2013",
    "numberOfPages": "404",
    "originDlLink": "http://filepi.com/i/egj9Wq7",
    "description": "How prepared are you to build fast and efficient web applications? This eloquent book provides what every web developer should know about the network, from fundamental limitations that affect performance to major innovations for building even more powerful browser applications - including HTTP 2.0 and XHR improvements, Server-Sent Events (SSE), WebSocket, and WebRTC.\r\n\r\nAuthor Ilya Grigorik, a web performance engineer at Google, demonstrates performance optimization best practices for TCP, UDP, and TLS protocols, and explains unique wireless and mobile network optimization requirements. You'll then dive into performance characteristics of technologies such as HTTP 2.0, client-side network scripting with XHR, real-time streaming with SSE and WebSocket, and P2P communication with WebRTC.",
    "originPageLink": "http://it-ebooks.info/book/3059",
    "index": 3059,
    "customBookName": "High Performance Browser Networking",
    "createTime": 1447145240725
  },
  {
    "bookName": "HTML5 in Action",
    "postSrc": "http://it-ebooks.info/images/ebooks/5/html5_in_action.jpg",
    "datePublished": "2014",
    "numberOfPages": "466",
    "originDlLink": "http://filepi.com/i/T2ulJZr",
    "description": "HTML5 is not a few new tags and features added to an old standard - it's the foundation of the modern web, enabling its interactive services, single-page UI, interactive games, and complex business applications. With support for standards-driven mobile app development, powerful features like local storage and WebSockets, superb audio and video APIs, and new layout options using CSS3, SVG, and Canvas, HTML5 has entered its prime time.\r\n\r\nHTML5 in Action provides a complete introduction to web development using HTML5. It explores the HTML5 specification through real-world examples and code samples. It earns the name \"in Action\" by giving you the practical, hands-on guidance you'll need to confidently build the sites and applications you—and your clients - have been wanting for years.",
    "originPageLink": "http://it-ebooks.info/book/3853",
    "index": 3853,
    "customBookName": "HTML5 IN ACTION",
    "createTime": 1447145240797
  },
  {
    "bookName": "Beginning Amazon Web Services with Node.js",
    "postSrc": "http://it-ebooks.info/images/ebooks/6/beginning_amazon_web_services_with_node.js.jpg",
    "datePublished": "2015",
    "numberOfPages": "260",
    "originDlLink": "http://filepi.com/i/i2OGnLY",
    "description": "Beginning Amazon Web Services with Node.js teaches any novice Node.js developer to configure, deploy, and maintain scalable small to large scale Node.js applications in Amazon Web Services. Hosting a Node.js application in a production environment usually means turning to PaaS hosting, but this approach brings problems. Deploying Node.js directly to AWS solves the problems you encounter in these situations, enabling you to cut out the middle man.\r\n\r\nYou will begin with a basic RESTful web service in Node.js, using the popular Express.js framework, pre-built and ready to run in your local environment. You will be introduced to the most powerful tools in AWS, and learn how to configure your project to take advantage of them. You will be guided through the steps of getting the various key components to work together on AWS. Through code samples using the AWS JavaScript SDK and tutorials in the AWS console, you will gain the knowledge to incorporate secure user authentication, server auto-scaling, a load balancer, CDN, customized caching behavior, and outage monitoring.",
    "originPageLink": "http://it-ebooks.info/book/5625",
    "index": 5625,
    "customBookName": "Begining Amazon Web Services with NodeJS",
    "createTime": 1447145240806
  },
  {
    "bookName": "Creating HTML5 Animations with Flash and Wallaby",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/creating_html5_animations_with_flash_and_wallaby.jpg",
    "datePublished": "2011",
    "numberOfPages": "62",
    "originDlLink": "http://filepi.com/i/KJTntzY",
    "description": "Creating standards-compliant animations for the Web just got a lot easier. With this concise guide, you'll learn how to convert Flash animations into HTML5, using Wallaby - the experimental tool from Adobe. Wallaby makes Flash content available for devices that don't support Flash runtimes, including the iPhone and iPad.\r\n\r\nDeveloping HTML5 animations is time-consuming with all the coding required. This book shows you how to create compelling content for HTML5 environments with relative ease, whether you know Flash or not. After a quick introduction to simple animation building with Flash, you'll learn how Wallaby helps you convert those animations into HTML5 code.",
    "originPageLink": "http://it-ebooks.info/book/615",
    "index": 615,
    "customBookName": "HTML5 Animations",
    "createTime": 1447145241049
  },
  {
    "bookName": "Introducing Regular Expressions",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/introducing_regular_expressions.jpg",
    "datePublished": "2012",
    "numberOfPages": "154",
    "originDlLink": "http://filepi.com/i/LXs9Erq",
    "description": "If you're a programmer new to regular expressions, this easy-to-follow guide is a great place to start. You'll learn the fundamentals step-by-step with the help of numerous examples, discovering first-hand how to match, extract, and transform text by matching specific words, characters, and patterns.\r\n\r\nRegular expressions are an essential part of a programmer's toolkit, available in various Unix utlilities as well as programming languages such as Perl, Java, JavaScript, and C#. When you've finished this book, you'll be familiar with the most commonly used syntax in regular expressions, and you'll understand how using them will save you considerable time.",
    "originPageLink": "http://it-ebooks.info/book/871",
    "index": 871,
    "customBookName": "Introducing Regular Expressions",
    "createTime": 1447145241266
  },
  {
    "bookName": "Beginning CSS3",
    "postSrc": "http://it-ebooks.info/images/ebooks/6/beginning_css3.jpg",
    "datePublished": "2012",
    "numberOfPages": "568",
    "originDlLink": "http://filepi.com/i/iFUlshF",
    "description": "Beginning CSS3 teaches you how to style web pages using Cascading Style Sheets (CSS) - the language of web design. Starting from first principles, you'll learn through a series of practical exercises how to change the default look of HTML tags, adding color, backgrounds, and borders. The book demystifies core concepts, such as the CSS box model and selectors, giving you the confidence and knowledge to create innovative and flexible page layouts. You'll also learn how to create rounded corners, drop shadows, and gradients without the need for images, using the latest CSS3 techniques",
    "originPageLink": "http://it-ebooks.info/book/1144",
    "index": 1144,
    "customBookName": "Begining CSS3",
    "createTime": 1447145241328
  },
  {
    "bookName": "HTML5 Canvas, 2nd Edition",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/html5_canvas_2nd_edition.jpg",
    "datePublished": "2013",
    "numberOfPages": "750",
    "originDlLink": "http://filepi.com/i/ZerOtop",
    "description": "Flash is fading fast as Canvas continues to climb. The 2nd edition of this popular book gets you started with HTML5 Canvas by showing you how to build interactive multimedia applications. You'll learn how to draw, render text, manipulate images, and create animation - all in the course of building an interactive web game throughout the book.\r\n\r\nUpdated for the latest implementations of Canvas and related HTML5 technologies, this edition includes clear and reusable code examples to help you quickly pick up the basics - whether you currently use Flash, Silverlight, or just HTML and JavaScript. Discover why HTML5 is the future of innovative web development.",
    "originPageLink": "http://it-ebooks.info/book/2261",
    "index": 2261,
    "customBookName": "HTML5 CANVAS",
    "createTime": 1447145241348
  },
  {
    "bookName": "Jump Start Bootstrap",
    "postSrc": "http://it-ebooks.info/images/ebooks/7/jump_start_bootstrap.jpg",
    "datePublished": "2014",
    "numberOfPages": "150",
    "originDlLink": "http://filepi.com/i/5RPaE2q",
    "description": "Originally developed by Twitter, Bootstrap is a front-end web framework that's revolutionized modern web development. It makes it easy to build professional, feature-packed websites in no time. Better still, Bootstrap is built from the ground up to be fully responsive, meaning your designs will look beautiful on any device, and in any browser.\r\n\r\nWhether you're a designer or a developer, you need to get acquainted with Bootstrap. Jump Start Bootstrap is the perfect primer to the most popular front-end framework available on the Web today.",
    "originPageLink": "http://it-ebooks.info/book/4515",
    "index": 4515,
    "customBookName": "JUMP START Bootstrap",
    "createTime": 1447145241589
  },
  {
    "bookName": "JavaScript & jQuery: The Missing Manual, 3rd Edition",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/javascript__jquery_the_missing_manual_3rd_edition.jpg",
    "datePublished": "2014",
    "numberOfPages": "686",
    "originDlLink": "http://filepi.com/i/TfVg1Rt",
    "description": "JavaScript lets you supercharge your HTML with animation, interactivity, and visual effects - but many web designers find the language hard to learn. This easy-to-read guide not only covers JavaScript basics, but also shows you how to save time and effort with the jQuery and jQuery UI libraries of prewritten JavaScript code. You'll build web pages that feel and act like desktop programs - with little or no programming.",
    "originPageLink": "http://it-ebooks.info/book/3884",
    "index": 3884,
    "customBookName": "Javascript and jQuery the missing manual",
    "createTime": 1447145241850
  },
  {
    "bookName": "Building Web Applications with SVG",
    "postSrc": "http://it-ebooks.info/images/ebooks/8/building_web_applications_with_svg.jpg",
    "datePublished": "2012",
    "numberOfPages": "294",
    "originDlLink": "http://filepi.com/i/K137ELD",
    "description": "Dive into SVG - and build striking, interactive visuals for your web applications. Led by three SVG experts, you'll learn step-by-step how to use SVG techniques for animation, overlays, and dynamic charts and graphs. Then you'll put it all together by building two graphic-rich applications. Get started creating dynamic visual content using web technologies you're familiar with - such as JavaScript, CSS, DOM, and AJAX.",
    "originPageLink": "http://it-ebooks.info/book/4220",
    "index": 4220,
    "customBookName": "Building Web Application with SVG",
    "createTime": 1447145242050
  },
  {
    "bookName": "Learning Ionic",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/learning_ionic.jpg",
    "datePublished": "2015",
    "numberOfPages": "388",
    "originDlLink": "http://filepi.com/i/Ukm7xhP",
    "description": "With this book, you will learn hybrid mobile application development using Ionic. This book uses Cordova 5.0.0, Ionic CLI 1.5.0, and Ionic 1.0.0 to explain the concepts and build apps.\r\n\r\nTo begin with, the book helps you understand where Ionic fits in today's world. Then, you will dive deep into Ionic CSS components and Ionic-AngularJS directives and services. You will also examine theming Ionic apps using the built-in SCSS setup.\r\n\r\nNext, you will learn to build an Ionic client for a secure REST API, where you will implement user authentication and token-based development. Cordova and ngCordova will be explored, and you will learn how you can integrate device-specific features such as a camera and Geolocation with an Ionic app. We will wrap up the book by building a messaging app, which deals with talking to Firebase (a real-time data store), as well as device features.",
    "originPageLink": "http://it-ebooks.info/book/6203",
    "index": 6203,
    "customBookName": "Learning Ionic",
    "createTime": 1447145242133
  },
  {
    "bookName": "Learning Redis",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/learning_redis.jpg",
    "datePublished": "2015",
    "numberOfPages": "318",
    "originDlLink": "http://filepi.com/i/2Y2HHsA",
    "description": "This book will introduce Redis and help you understand its various facets.\r\n\r\nStarting with an introduction to NoSQL, you will learn how to install Redis and how to classify and work with data structures. By working with real world scenarios pertaining to using Redis, you will discover sharding and indexing techniques, along with how to improve scalability and performance through persistent strategies and data migration techniques. With the help of multiple examples, you will learn to design web and business applications. You will also learn how to configure Redis for setting up clusters and tuning it for performance.\r\n\r\nAt the end of this book, you will find essential tips on backup and recovery strategies for the Redis environment.",
    "originPageLink": "http://it-ebooks.info/book/6109",
    "index": 6109,
    "customBookName": "Learning Redis",
    "createTime": 1447145242144
  },
  {
    "bookName": "Learning Responsive Web Design",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/learning_responsive_web_design.jpg",
    "datePublished": "2014",
    "numberOfPages": "416",
    "originDlLink": "http://filepi.com/i/MG0iCaJ",
    "description": "Deliver an optimal user experience to all devices - including tablets, smartphones, feature phones, laptops, and large screens—by learning the basics of responsive web design. In this hands-on guide, UX designer Clarissa Peterson explains how responsive web design works, and takes you through a responsive workflow from project kickoff to site launch.\r\n\r\nIdeal for anyone involved in the process of creating websites - not just developers - this book teaches you fundamental strategies and techniques for using HTML and CSS to design websites that not only adapt to any screen size, but also use progressive enhancement to provide a better user experience based on device capabilities such as touchscreens and retina displays.",
    "originPageLink": "http://it-ebooks.info/book/3522",
    "index": 3522,
    "customBookName": "Learning Responsive Web Design",
    "createTime": 1447145242377
  },
  {
    "bookName": "Learning Highcharts 4",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/learning_highcharts_4.jpg",
    "datePublished": "2015",
    "numberOfPages": "478",
    "originDlLink": "http://filepi.com/i/vRMZJyd",
    "description": "Highcharts is a popular type of web charting software that produces stunning and smooth animated HTML5 SVG graphs.\r\n\r\nJoe Kuan continues the Learning Highcharts series, with the second edition comprising of brand new content and revised chapters. The book covers all the graphs supported in Highcharts 4. Step-by-step tutorials demonstrate how to create presentable charts with real-life data. The book also explores how to replicate industry charts from a financial brochure, sports article, 3D infographics, and even a Fiat 500 speedometer.\r\n\r\nThe second part of the book focuses on the operational side; APIs, events, and framework integration. The third part of the book looks into the server side and online services, how Highcharts/PhantomJS works, and demonstrates the usage and reviews the latest exciting development, Highcharts Cloud—an online chart service without any prior Highcharts or JavaScript experience needed. You just need to insert the data and it does the rest.",
    "originPageLink": "http://it-ebooks.info/book/5642",
    "index": 5642,
    "customBookName": "Learning Highcharts 4",
    "createTime": 1447145242382
  },
  {
    "bookName": "MEAN Web Development",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/mean_web_development.jpg",
    "datePublished": "2014",
    "numberOfPages": "354",
    "originDlLink": "http://filepi.com/i/BvnnFTH",
    "description": "The MEAN stack is a collection of the most popular modern tools for web development; it comprises MongoDB, Express, AngularJS, and Node.js.\r\n\r\nStarting with MEAN core frameworks, this project-based guide will explain the key concepts of each framework, how to set them up properly, and how to use popular modules to connect it all together. By following the real-world examples shown in this tutorial, you will scaffold your MEAN application architecture, add an authentication layer, and develop an MVC structure to support your project development. Finally, you will walk through the different tools and frameworks that will help expedite your daily development cycles.\r\n\r\nWatch how your application development grows by learning from the only guide that is solely orientated towards building a full, end-to-end, real-time application using the MEAN stack!",
    "originPageLink": "http://it-ebooks.info/book/4849",
    "index": 4849,
    "customBookName": "Mean Web Development",
    "createTime": 1447145242941
  },
  {
    "bookName": "Mastering Nginx",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/mastering_nginx.jpg",
    "datePublished": "2013",
    "numberOfPages": "322",
    "originDlLink": "http://filepi.com/i/WBfOAo8",
    "description": "NGINX is a high-performance HTTP server and mail proxy designed to use very few system resources. With the many tutorials and example configurations floating around the Web, it is difficult to know how to properly configure NGINX to meet your expectations.\r\n\r\nMastering Nginx - will serve to clarify the murky waters of NGINX configuration, helping you learn how to tune NGINX for various situations, what some of the more obscure configuration directives do, and how to design a decent configuration to match your needs.",
    "originPageLink": "http://it-ebooks.info/book/4178",
    "index": 4178,
    "customBookName": "Mastering Nginx",
    "createTime": 1447145242948
  },
  {
    "bookName": "Linux Shell Scripting Cookbook",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/linux_shell_scripting_cookbook.jpg",
    "datePublished": "2011",
    "numberOfPages": "360",
    "originDlLink": "http://filepi.com/i/eyev6ZF",
    "description": "GNU/Linux is a remarkable operating system that comes with a complete development environment that is stable, reliable, and extremely powerful. The shell being the native interface to communicate with the operating system is capable of controlling the entire operating system. There are numerous commands on Linux shell which are documented but hard to understand. The man pages are helpful but they are very lengthy and it does not give any clues on key areas where commands can be used. Proper usage of shell commands can easily solve many complex tasks with a few lines of code, but most linux users don't have the right know-how to use the Linux shell to its full potential.",
    "originPageLink": "http://it-ebooks.info/book/4133",
    "index": 4133,
    "customBookName": "Linux Shell Scripting Cookbook 2nd Edition",
    "createTime": 1447145243113
  },
  {
    "bookName": "Mobile First Design with HTML5 and CSS3",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/mobile_first_design_with_html5_and_css3.jpg",
    "datePublished": "2013",
    "numberOfPages": "122",
    "originDlLink": "http://filepi.com/i/66q23xx",
    "description": "The mobile first design philosophy aims to develop websites that will be lean and fast on small screens without sacrificing a tablet or desktop experience. Using HTML5, CSS3, and simple, standardized modern web tools you can make one site to rule them all.\r\n\r\nMobile First Design with HTML5 and CSS3 will teach you the tools you need to make a modern, standards-based web page that displays beautifully on nearly any web browser - essential knowledge for anyone who makes websites!",
    "originPageLink": "http://it-ebooks.info/book/3159",
    "index": 3159,
    "customBookName": "Mobile First Design with HTML5 And CSS3",
    "createTime": 1447145243178
  },
  {
    "bookName": "Getting Started with Meteor.js JavaScript Framework, 2nd Edition",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/getting_started_with_meteor.js_javascript_framework_2nd_edition.jpg",
    "datePublished": "2015",
    "numberOfPages": "138",
    "originDlLink": "http://filepi.com/i/mfUrx1Q",
    "description": "Meteor is one of the most popular development platforms available today, allowing you to create and deploy mobile and web applications in a fraction of the time needed by other JavaScript frameworks. Getting Started with Meteor.js JavaScript Framework Second Edition is an easy to follow, step-by-step approach to learning how to build modern web applications with Meteor.\r\n\r\nYou will begin with a look \"under the hood\" to see what makes Meteor so special. Next, you will build a complete, working application from scratch, gaining a thorough understanding of Meteor's major features including: data on the wire, web templates, declarative programming, full-stack reactivity, modularity, third-party packages, and MongoDB/NoSQL databases. Finally, you will learn how to harden your app, prepare it for production release, and quickly deploy it using Meteor's public servers or your own custom server. With updated screenshots and code, this second edition will show you exactly why Meteor is the choice for rapid, elegant application development.",
    "originPageLink": "http://it-ebooks.info/book/6059",
    "index": 6059,
    "customBookName": "Getting Started with MeteorJS",
    "createTime": 1447145243438
  },
  {
    "bookName": "Nginx Module Extension",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/nginx_module_extension.jpg",
    "datePublished": "2013",
    "numberOfPages": "128",
    "originDlLink": "http://filepi.com/i/AdK8TUi",
    "description": "Companies can solve significant scaling issues thanks to switching their web platforms to Nginx. A popular web server for building web infrastructure, Nginx transparently and effectively enables the growth of the largest sites on the Internet today, on top of being free and open source.\r\n\r\nThis book is a practical reference providing you with everything you need to know about Nginx module extensions. You will learn how to write powerful and flexible configuration files and your own modules, as well as gaining knowledge about Nginx's modular architecture, available modules, and their intricate details.",
    "originPageLink": "http://it-ebooks.info/book/3326",
    "index": 3326,
    "customBookName": "Nginx Module Extension",
    "createTime": 1447145243725
  },
  {
    "bookName": "MongoDB: The Definitive Guide, 2nd Edition",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/mongodb_the_definitive_guide_2nd_edition.jpg",
    "datePublished": "2013",
    "numberOfPages": "432",
    "originDlLink": "http://filepi.com/i/mU2C2ii",
    "description": "Manage the huMONGOus amount of data collected through your web application with MongoDB. This authoritative introduction—written by a core contributor to the project—shows you the many advantages of using document-oriented databases, and demonstrates how this reliable, high-performance system allows for almost infinite horizontal scalability.\r\n\r\nThis updated second edition provides guidance for database developers, advanced configuration for system administrators, and an overview of the concepts and use cases for other people on your project. Ideal for NoSQL newcomers and experienced MongoDB users alike, this guide provides numerous real-world schema design examples.",
    "originPageLink": "http://it-ebooks.info/book/2333",
    "index": 2333,
    "customBookName": "MongoDB The Definitive Guide 2nd Edition",
    "createTime": 1447145243731
  },
  {
    "bookName": "Values, Units, and Colors",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/values_units_and_colors.jpg",
    "datePublished": "2012",
    "numberOfPages": "46",
    "originDlLink": "http://filepi.com/i/MUkqqWM",
    "description": "Nearly everything you do with CSS involves units for determining the look and formatting of your web page elements. With this concise guide, you'll learn how to work with an array of units - including measurements and keywords - that help you define color, text, distance between elements, location of external files, and other values.",
    "originPageLink": "http://it-ebooks.info/book/938",
    "index": 938,
    "customBookName": "Values Unit and Colors",
    "createTime": 1447145243736
  },
  {
    "bookName": "Nginx HTTP Server, 2nd Edition",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/nginx_http_server_2nd_edition.jpg",
    "datePublished": "2013",
    "numberOfPages": "318",
    "originDlLink": "http://filepi.com/i/nPtSStZ",
    "description": "Nginx is a lightweight HTTP server designed for high-traffic websites, with network scalability as the primary objective. With the advent of high speed Internet access, short loading times and fast transfer rates have become a necessity. This free, open source solution will either come as a full replacement of other software such as Apache, or stand in front of your existing infrastructure to improve its overall speed.\r\n\r\nNginx HTTP Server, 2nd Edition provides a detailed guide to setting up Nginx in different ways that correspond to actual production situations: as a standalone server, as a reverse proxy, interacting with applications via FastCGI and more. In addition, the complete directive reference will be your best friend at all stages of the configuration and maintenance processes.",
    "originPageLink": "http://it-ebooks.info/book/3110",
    "index": 3110,
    "customBookName": "Nginx HTTP Server 2nd Edition",
    "createTime": 1447145243920
  },
  {
    "bookName": "Data Structures and Algorithms with JavaScript",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/data_structures_and_algorithms_with_javascript.jpg",
    "datePublished": "2014",
    "numberOfPages": "246",
    "originDlLink": "http://filepi.com/i/x4qoAFZ",
    "description": "As an experienced JavaScript developer moving to server-side programming, you need to implement classic data structures and algorithms associated with conventional object-oriented languages like C# and Java. This practical guide shows you how to work hands-on with a variety of storage mechanisms—including linked lists, stacks, queues, and graphs—within the constraints of the JavaScript environment.\r\n\r\nDetermine which data structures and algorithms are most appropriate for the problems you're trying to solve, and understand the tradeoffs when using them in a JavaScript program.",
    "originPageLink": "http://it-ebooks.info/book/3294",
    "index": 3294,
    "customBookName": "Data Structures and Algorithms with JavaScript",
    "createTime": 1447145244282
  },
  {
    "bookName": "Node.js in Practice",
    "postSrc": "http://it-ebooks.info/images/ebooks/5/node.js_in_practice.jpg",
    "datePublished": "2014",
    "numberOfPages": "424",
    "originDlLink": "http://filepi.com/i/3i8SoNl",
    "description": "You've decided to use Node.js for your next project and you need the skills to implement Node in production. It would be great to have Node experts Alex Young and Marc Harter at your side to help you tackle those day-to-day challenges. With this book, you can!\r\n\r\nNode.js in Practice is a collection of 115 thoroughly tested examples and instantly useful techniques guaranteed to make any Node application go more smoothly. Following a common-sense Problem/Solution format, these experience-fueled techniques cover important topics like event-based programming, streams, integrating external applications, and deployment. The abundantly annotated code makes the examples easy to follow, and techniques are organized into logical clusters, so it's a snap to find what you're looking for.",
    "originPageLink": "http://it-ebooks.info/book/6349",
    "index": 6349,
    "customBookName": "NodeJS In Practice",
    "createTime": 1447145244494
  },
  {
    "bookName": "Node.js in Action",
    "postSrc": "http://it-ebooks.info/images/ebooks/5/node.js_in_action.jpg",
    "datePublished": "2013",
    "numberOfPages": "416",
    "originDlLink": "http://filepi.com/i/CEGmE7r",
    "description": "JavaScript on the server? You bet. Node.js is a JavaScript server capable of supporting scalable, high-performance web applications. Using asynchronous I/O, the server can do more than one thing at a time, a key requirement for real-time apps like chat, games, and live statistics. And since it's JavaScript, you use the same language end to end.\r\n\r\nNode.js in Action shows you how to build production-quality applications. Clear introductions of key concepts and example-by-example coverage take you from setup to deployment. You'll dive into asynchronous programming, data storage, and output templating, and interact with the filesystem to create non-HTTP applications like TCP/IP servers and command-line tools. Perfect for a web developer transitioning from Rails, Django, or PHP. Requires basic knowledge of JavaScript. No prior experience with Node.js needed.",
    "originPageLink": "http://it-ebooks.info/book/3851",
    "index": 3851,
    "customBookName": "Nodejs in Action",
    "createTime": 1447145244525
  },
  {
    "bookName": "NW.js Essentials",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/nw.js_essentials.jpg",
    "datePublished": "2015",
    "numberOfPages": "192",
    "originDlLink": "http://filepi.com/i/fJDHSxD",
    "description": "Using Node.js, we can create web applications easily. Now, thanks to NW.js, we can also create desktop apps with it using a unique combination of HTML5 and Node. NW.js is a runtime application based on Chromium and Node.js.\r\n\r\nIn this book, you'll discover how to leverage well-known programming languages, such as JavaScript, HTML, and CSS in order to create NW.js desktop applications.\r\n\r\nYou will implement your first simple application right from the first chapter and see how easy it is to use the platform, after which you will learn about Native UI APIs and the different approaches to Node.js programming.\r\n\r\nYou'll get a complete picture of the many possible ways to package and deploy NW.js applications on Microsoft Windows, Mac OS X, and Linux. So, get ready to explore NW.js and build a real, and complex, application.",
    "originPageLink": "http://it-ebooks.info/book/6062",
    "index": 6062,
    "customBookName": "NWJS Essentials",
    "createTime": 1447145244530
  },
  {
    "bookName": "Pragmatic Guide to Subversion",
    "postSrc": "http://it-ebooks.info/images/ebooks/1/pragmatic_guide_to_subversion.jpg",
    "datePublished": "2010",
    "numberOfPages": "150",
    "originDlLink": "http://filepi.com/i/UV7cD0E",
    "description": "Subversion is the most popular open-source version control system on the planet. Development teams-big and small, enterprise and open source-use this fast, feature-rich tool daily. Pragmatic Guide to Subversion presents the 48 essential tasks you need to know. It's your shortcut to the Subversion master's recommended set of best practices. With this book, you can get to the good parts quickly, and be more productive and effective.",
    "originPageLink": "http://it-ebooks.info/book/3419",
    "index": 3419,
    "customBookName": "Pragmatic Guide to Subversion",
    "createTime": 1447145244708
  },
  {
    "bookName": "Pro AngularJS",
    "postSrc": "http://it-ebooks.info/images/ebooks/6/pro_angularjs.jpg",
    "datePublished": "2014",
    "numberOfPages": "688",
    "originDlLink": "http://filepi.com/i/PIUp07j",
    "description": "AngularJS is the leading framework for building dynamic JavaScript applications that take advantage of the capabilities of modern browsers and devices. AngularJS, which is maintained by Google, brings the power of the MVC pattern to the client, providing the foundation for complex and rich web apps. It allows you to build applications that are smaller, faster, and with a lighter resource footprint than ever before.\r\n\r\nBest-selling author Adam Freeman explains how to get the most from AngularJS. He begins by describing the MVC pattern and the many benefits that can be gained from separating your logic and presentation code. He then shows how you can use AngularJS's features within in your projects to produce professional-quality results. Starting from the nuts-and-bolts and building up to the most advanced and sophisticated features AngularJS is carefully unwrapped, going in-depth to give you the knowledge you need.",
    "originPageLink": "http://it-ebooks.info/book/5338",
    "index": 5338,
    "customBookName": "Pro AngularJS",
    "createTime": 1447145244826
  },
  {
    "bookName": "Pro CSS for High Traffic Websites",
    "postSrc": "http://it-ebooks.info/images/ebooks/6/pro_css_for_high_traffic_websites.jpg",
    "datePublished": "2011",
    "numberOfPages": "432",
    "originDlLink": "http://filepi.com/i/Q3SrM67",
    "description": "Although web standards-based websites can scale effectively - and basic CSS will give you basic results - there are considerations and obstacles that high traffic websites must face to keep your development and hosting costs to a minimum. There are many tips and tricks, as well as down-to-earth best practice information, to make sure that everything runs quickly and efficiently with the minimum amount of fuss or developer intervention. Targeted at \"high traffic\" websites - those receiving over 10,000 unique visitors a day - Pro CSS for High Traffic Websites gives you inside information from the professionals on how to get the most out of your web development team.  ",
    "originPageLink": "http://it-ebooks.info/book/5567",
    "index": 5567,
    "customBookName": "Pro CSS for High Traffic Websites",
    "createTime": 1447145245274
  },
  {
    "bookName": "Pro Express.js",
    "postSrc": "http://it-ebooks.info/images/ebooks/6/pro_express.js.jpg",
    "datePublished": "2014",
    "numberOfPages": "372",
    "originDlLink": "http://filepi.com/i/Zl9HAKV",
    "description": "Pro Express.js is for the reader who wants to quickly get up-to-speed with Express.js, the flexible Node.js framework. Author Azat Mardan clearly explains how to start developing with Express.js with a basic 'Hello World', and then delves into a deep API reference, before looking at common and abstract development problems. Lastly, you will learn how to build a series of real-world apps in order to cement your knowledge.\r\n\r\nIn order to get the best from this book, you will be familiar with Node.js scripts and able to install packages using npm. In the deep API reference, each aspect of the Express.js API is explained clearly with a simple exercise to demonstrate its usage. This includes configuration, settings and environments; different middleware and its uses; templating engines; extracting parameters and routing; request and response; error handling; and running an app. In the next part you'll delve into abstraction, streams, authentication, multithreading, Socket.io, security, and more complex modules. You will also learn about smaller frameworks built using Express.js, such as Sails.js, and Derby. Finally you'll build real-world apps including a REST API, Todo App, and Instagram gallery.",
    "originPageLink": "http://it-ebooks.info/book/5468",
    "index": 5468,
    "customBookName": "Pro ExpressJS",
    "createTime": 1447145245325
  },
  {
    "bookName": "Pro JavaScript for Web Apps",
    "postSrc": "http://it-ebooks.info/images/ebooks/6/pro_javascript_for_web_apps.jpg",
    "datePublished": "2012",
    "numberOfPages": "280",
    "originDlLink": "http://filepi.com/i/E1GxniN",
    "description": "Pro JavaScript for Web Apps gives you all of the information that you need to create professional, optimized, and efficient JavaScript applications that will run across all devices. It takes you through all aspects of modern JavaScript application creation, showing you how to combine JavaScript with the new features of HTML5 and CSS3 to make the most of the new web technologies.\r\n\r\nThe focus of the book is on creating professional web applications, ensuring that your app provides the best experience for your users, with smooth and responsive control and feedback and an intuitive and optimized interface. You will learn how to take a basic application and bring it up to a professional level while making sure that it remains bullet-proof and bug free. Pro JavaScript for Web Apps will also enhance your development workflow using jQuery to streamline the process and freeing you to spend more time on the important parts of your app while the framework deals with the mundanity.",
    "originPageLink": "http://it-ebooks.info/book/5588",
    "index": 5588,
    "customBookName": "Pro JavaScript for Web Apps",
    "createTime": 1447145245358
  },
  {
    "bookName": "Pro CSS3 Animation",
    "postSrc": "http://it-ebooks.info/images/ebooks/6/pro_css3_animation.jpg",
    "datePublished": "2012",
    "numberOfPages": "188",
    "originDlLink": "http://filepi.com/i/Zof0s8s",
    "description": "Pro CSS3 Animation will teach you how to use fresh new CSS3 syntax to fully utilize this exciting tool for web design. Using cutting-edge industry standards and drawing on best practices for animation, you will learn how to apply CSS3 animation to transform and bring your page content to life.\r\n\r\nCSS3 is the way forward for web page interactivity and animation, offering new and exciting options for design. Integrated with HTML5, SVG and mobile design methodologies, you can bring sites into the third dimension to change the perception and appreciation generated in your audience.",
    "originPageLink": "http://it-ebooks.info/book/5048",
    "index": 5048,
    "customBookName": "Pro CSS3 Animation",
    "createTime": 1447145245676
  },
  {
    "bookName": "Pro Git, 2nd Edition",
    "postSrc": "http://it-ebooks.info/images/ebooks/6/pro_git_2nd_edition.jpg",
    "datePublished": "2014",
    "numberOfPages": "456",
    "originDlLink": "http://filepi.com/i/8J00DRN",
    "description": "Pro Git (2nd Edition) is your fully-updated guide to Git and its usage in the modern world. Git has come a long way since it was first developed by Linus Torvalds for Linux kernel development. It has taken the open source world by storm since its inception in 2005, and this book teaches you how to use it like a pro.\r\n\r\nEffective and well-implemented version control is a necessity for successful web projects, whether large or small. With this book you'll learn how to master the world of distributed version workflow, use the distributed features of Git to the full, and extend Git to meet your every need.",
    "originPageLink": "http://it-ebooks.info/book/5423",
    "index": 5423,
    "customBookName": "Pro Git",
    "createTime": 1447145245743
  },
  {
    "bookName": "Pro Vim",
    "postSrc": "http://it-ebooks.info/images/ebooks/6/pro_vim.jpg",
    "datePublished": "2014",
    "numberOfPages": "424",
    "originDlLink": "http://filepi.com/i/kCyk1Uq",
    "description": "Pro Vim teaches you the real-world workflows, tips, and tricks of this powerful, terminal-based text editor. This book covers all the essentials, as well as lesser-known but equally powerful features that will ensure you become a top-level performant and professional user, able to jump between multiple sessions while manipulating and controlling with ease many different documents and programming files. With easy-to-digest chapters on all the areas you need to learn, this book is a key addition to your library that will enable you to become a fast, efficient user of Vim.\r\n\r\nUsing this book, you will learn how to properly configure your terminal environment and work without even touching the mouse. You will become an expert in how Vim actually works: how buffers and sessions work, automation through Macros and shell scripting, real-world workflows, and how to work efficiently and fast with plugins and different themes. You will also learn practical, real-world tips on how to best utilize Vim alongside the terminal multiplexer tmux; helping you to manage files across multiple servers and terminal sessions. Avoid common pitfalls and work with best practice ways to efficiently edit and control your files and sessions from the terminal interface.",
    "originPageLink": "http://it-ebooks.info/book/5432",
    "index": 5432,
    "customBookName": "Pro Vim",
    "createTime": 1447145246374
  },
  {
    "bookName": "Pro TypeScript",
    "postSrc": "http://it-ebooks.info/images/ebooks/6/pro_typescript.jpg",
    "datePublished": "2014",
    "numberOfPages": "248",
    "originDlLink": "http://filepi.com/i/RN7Sqt2",
    "description": "JavaScript is everywhere, both as a pure language and in popular libraries like Angular, jQuery and Knockout, but users of modern object-oriented languages like Java and C# often find JavaScript frustrating to use and hard to extend to large-scale applications. TypeScript is an innovative open source language from Microsoft that combines powerful language features and enhanced tooling support with the key attractions of JavaScript as a flexible, dynamic language that can run in any browser and on any operating system. Pro TypeScript tells you everything you need to know about this exciting new language and how to use it in your applications.\r\n\r\nStarting with an introduction to the language and its features, the book takes you through some of the major features of TypeScript in depth, from working with the type system through object-orientation to understanding the runtime and the TypeScript compiler.",
    "originPageLink": "http://it-ebooks.info/book/5394",
    "index": 5394,
    "customBookName": "Pro TypeScript",
    "createTime": 1447145246402
  },
  {
    "bookName": "Professional JavaScript for Web Developers, 3rd Edition",
    "postSrc": "http://it-ebooks.info/images/ebooks/2/professional_javascript_for_web_developers_3rd_edition.jpg",
    "datePublished": "2012",
    "numberOfPages": "960",
    "originDlLink": "http://filepi.com/i/etNY9wf",
    "description": "If you want to achieve JavaScript's full potential, it is critical to understand its nature, history, and limitations. To that end, this updated version of the bestseller by veteran author and JavaScript guru Nicholas C. Zakas covers JavaScript from its very beginning to the present-day incarnations including the DOM, Ajax, and HTML5. Zakas shows you how to extend this powerful language to meet specific needs and create dynamic user interfaces for the web that blur the line between desktop and internet. By the end of the book, you'll have a strong understanding of the significant advances in web development as they relate to JavaScript so that you can apply them to your next website.",
    "originPageLink": "http://it-ebooks.info/book/483",
    "index": 483,
    "customBookName": "Professional JavaScript for Web Developers",
    "createTime": 1447145246423
  },
  {
    "bookName": "RESTful Web API Design with Node.js",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/restful_web_api_design_with_node.js.jpg",
    "datePublished": "2015",
    "numberOfPages": "152",
    "originDlLink": "http://filepi.com/i/PyePWkd",
    "description": "In this era of cloud computing, every data provisioning solution is built in a scalable and fail-safe way. Thus, when building RESTful services, the right choice of the underlying platform is vital. Node.js, with its asynchronous, event-driven architecture, is just the right choice to build RESTful APIs.\r\n\r\nThis book will be your step-by-step guide in the RESTful world of Node.js. It starts with the implementation of a simple HTTP handler application and follows its evolution to a completed RESTful service solution, which introduces you to the best practices in developing RESTful services.",
    "originPageLink": "http://it-ebooks.info/book/5961",
    "index": 5961,
    "customBookName": "Restful Web API Design with NodeJS",
    "createTime": 1447145246541
  },
  {
    "bookName": "Programming Chrome Apps",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/programming_chrome_apps.jpg",
    "datePublished": "2015",
    "numberOfPages": "274",
    "originDlLink": "http://filepi.com/i/ESLhb0B",
    "description": "Put your web app design skills to work by learning how to create powerful and portable Chrome Apps. With this practical book, you'll learn how to build Google's unique apps to behave just like native apps so they can interact with hardware devices, access external files, and send notifications.\r\n\r\nAuthor Marc Rochkind takes you through a hands-on, objective tour of Chrome Apps, which run on any platform that supports the Chrome browser—including OS X, Windows, Linux, as well as Android and iOS. If you know how to work with HTML, CSS, JavaScript, and the DOM, you're ready to get started.",
    "originPageLink": "http://it-ebooks.info/book/4753",
    "index": 4753,
    "customBookName": "Programming Chrome Apps",
    "createTime": 1447145246715
  },
  {
    "bookName": "React: Up & Running",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/react_up__running_early_release.jpg",
    "datePublished": "2015",
    "numberOfPages": "250",
    "originDlLink": "http://filepi.com/i/qQ6jExc",
    "description": "React is a new, open-source technology from Facebook that has stirred quite a storm in the web development community, and some would say it's the next best thing to a silver bullet for building web applications. With React: Up and Running you'll learn how to get off the ground with React, with no prior knowledge.\r\n\r\nThis book teaches you how to build components, the building blocks of your apps, as well as how to organize the components into large-scale apps. In addition, you'll learn about unit testing and optimizing performance, while focusing on the application's data (and letting the UI take care of itself).",
    "originPageLink": "http://it-ebooks.info/book/6081",
    "index": 6081,
    "customBookName": "React Up and Running",
    "createTime": 1447145246943
  },
  {
    "bookName": "Python for Data Analysis",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/python_for_data_analysis.jpg",
    "datePublished": "2012",
    "numberOfPages": "472",
    "originDlLink": "http://filepi.com/i/88U7T4b",
    "description": "Python for Data Analysis is concerned with the nuts and bolts of manipulating, processing, cleaning, and crunching data in Python. It is also a practical, modern introduction to scientific computing in Python, tailored for data-intensive applications. This is a book about the parts of the Python language and libraries you'll need to effectively solve a broad set of data analysis problems. This book is not an exposition on analytical methods using Python as the implementation language.",
    "originPageLink": "http://it-ebooks.info/book/1041",
    "index": 1041,
    "customBookName": "Python for Data Analysis",
    "createTime": 1447145247170
  },
  {
    "bookName": "Regular Expressions Cookbook, 2nd Edition",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/regular_expressions_cookbook_2nd_edition.jpg",
    "datePublished": "2012",
    "numberOfPages": "612",
    "originDlLink": "http://filepi.com/i/7FWiSPS",
    "description": "Take the guesswork out of using regular expressions. With more than 140 practical recipes, this cookbook provides everything you need to solve a wide range of real-world problems. Novices will learn basic skills and tools, and programmers and experienced users will find a wealth of detail. Each recipe provides samples you can use right away.\r\n\r\nThis revised edition covers the regular expression flavors used by C#, Java, JavaScript, Perl, PHP, Python, Ruby, and VB.NET. You'll learn powerful new tricks, avoid flavor-specific gotchas, and save valuable time with this huge library of practical solutions.",
    "originPageLink": "http://it-ebooks.info/book/920",
    "index": 920,
    "customBookName": "Regular Expressions Cookbook",
    "createTime": 1447145247214
  },
  {
    "bookName": "CSS3: The Missing Manual, 3rd Edition",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/css3_the_missing_manual_3rd_edition.jpg",
    "datePublished": "2012",
    "numberOfPages": "656",
    "originDlLink": "http://filepi.com/i/RRBw1Ad",
    "description": "CSS3 lets you create professional-looking websites, but learning its finer points can be tricky - even for seasoned web developers. This Missing Manual shows you how to take your HTML and CSS skills to the next level, with valuable tips, tricks, and step-by-step instructions. You'll quickly learn how to build web pages that look great and run fast on devices and screens of all sizes.",
    "originPageLink": "http://it-ebooks.info/book/1356",
    "index": 1356,
    "customBookName": "CSS3 the missing manual",
    "createTime": 1447145247575
  },
  {
    "bookName": "You Don't Know JS: Scope & Closures",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/you_dont_know_js_scope__closures.jpg",
    "datePublished": "2014",
    "numberOfPages": "98",
    "originDlLink": "http://filepi.com/i/gA7O2DZ",
    "description": "No matter how much experience you have with JavaScript, odds are you don't fully understand the language. This concise yet in-depth guide takes you inside scope and closures, two core concepts you need to know to become a more efficient and effective JavaScript programmer. You'll learn how and why they work, and how an understanding of closures can be a powerful part of your development skillset.\r\n\r\nLike other books in the \"You Don't Know JS\" series, Scope and Closures dives into trickier parts of the language that many JavaScript programmers simply avoid. Armed with this knowledge, you can achieve true JavaScript mastery.",
    "originPageLink": "http://it-ebooks.info/book/3312",
    "index": 3312,
    "customBookName": "You Donot Know JS Scope and Closures",
    "createTime": 1447145247750
  },
  {
    "bookName": "Sass and Compass in Action",
    "postSrc": "http://it-ebooks.info/images/ebooks/5/sass_and_compass_in_action.jpg",
    "datePublished": "2013",
    "numberOfPages": "240",
    "originDlLink": "http://filepi.com/i/sMvCnQN",
    "description": "For 15 years, we've been using CSS to patiently paint the web by hand. No more! Sass and Compass add scripting and a library of components to standard CSS so you can simplify stylesheet authoring, automate tedious tasks, and add dynamic styling features to your pages. Think of Sass and Compass as power tools that allow you to paint with remarkable speed and precision.\r\n\r\nSass and Compass in Action is a hands-on guide to stylesheet authoring using these two revolutionary tools. This practical book shows you how to eliminate common CSS pain points and concentrate on making your pages pop. You'll begin with simple topics like CSS resets and then progress to more substantial challenges like building a personal stylesheet framework to bundle and reuse your own approaches and opinions.",
    "originPageLink": "http://it-ebooks.info/book/3573",
    "index": 3573,
    "customBookName": "Sass and Compass In Action",
    "createTime": 1447145247763
  },
  {
    "bookName": "TextMate How-To",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/textmate_how-to.jpg",
    "datePublished": "2012",
    "numberOfPages": "76",
    "originDlLink": "http://filepi.com/i/pJX9xi3",
    "description": "Hit the ground running using the powerfully versatile text and code editor - TextMate from Macromates. Attention on keyboard shortcuts and multiple routes to actions to satisfy anyone's preferred coding style. Installing and use several extremely helpful bundles such as Todo, Zen Coding, Markdown, and more. Extensive coverage on navigating and searching one or many files, in and out of projects. Learn skills on utilizing the shell command-line and macros to boost your productivity.",
    "originPageLink": "http://it-ebooks.info/book/3941",
    "index": 3941,
    "customBookName": "TextMate How",
    "createTime": 1447145247970
  },
  {
    "bookName": "Introduction to React",
    "postSrc": "http://it-ebooks.info/images/ebooks/6/introduction_to_react.jpg",
    "datePublished": "2015",
    "numberOfPages": "148",
    "originDlLink": "http://filepi.com/i/sTzLmRl",
    "description": "Introduction to React teaches you React, the JavaScript framework created by developers at Facebook, to solve the problem of building complex user interfaces in a consistent and maintainable way. React.js shrugs away common front-end conventions in an effort to make things more efficient - use Introduction to React to learn about this framework and more today.\r\n\r\nGet to know the React API and it's specific JavaScript extension, JSX, which makes authoring React components easier and maintainable. You will also learn how to test your React applications and about the tools you can use while building. Once you understand these core concepts, you can build applications with React. This will help you cement the ideas and fundamentals of React and prepare you to utilize React in your own use case.",
    "originPageLink": "http://it-ebooks.info/book/6374",
    "index": 6374,
    "customBookName": "Introduction to React",
    "createTime": 1447145248016
  },
  {
    "bookName": "Think Python",
    "postSrc": "http://it-ebooks.info/images/ebooks/3/think_python.jpg",
    "datePublished": "2012",
    "numberOfPages": "300",
    "originDlLink": "http://filepi.com/i/uY09cSO",
    "description": "If you want to learn how to program, working with Python is an excellent way to start. This hands-on guide takes you through the language one step at a time, beginning with basic programming concepts before moving on to functions, recursion, data structures, and object-oriented design.\r\n\r\nThrough exercises in each chapter, you'll try out programming concepts as you learn them. Think Python is ideal for students at the high school or college level, as well as self-learners, home-schooled students, and professionals who need to learn programming basics.",
    "originPageLink": "http://it-ebooks.info/book/922",
    "index": 922,
    "customBookName": "Think Python",
    "createTime": 1447145248195
  },
  {
    "bookName": "PhantomJS Cookbook",
    "postSrc": "http://it-ebooks.info/images/ebooks/14/phantomjs_cookbook.jpg",
    "datePublished": "2014",
    "numberOfPages": "304",
    "originDlLink": "http://filepi.com/i/jg3fP4l",
    "description": "Beginning with the basics of PhantomJS, this book will dive into its core modules and guide you through how to solve real-world testing problems. This book explores a variety of test automation tasks, including executing JavaScript unit tests with the Jasmine, QUnit, and Mocha frameworks; functional tests with tools such as Selenium, Capybara, and CasperJS; performance analysis with tools such as YSlow; and much more.\r\n\r\nIf you are a web developer looking to run automated unit tests while you work, or perhaps you are a QA engineer looking for a fast test automation utility, then this book is perfect for you. Some prior knowledge of JavaScript would be helpful.",
    "originPageLink": "http://it-ebooks.info/book/3558",
    "index": 3558,
    "customBookName": "PhantomJS Cookbook",
    "createTime": 1447145248505
  },
  {
    "bookName": "Algorithms: Part I, 4th Edition",
    "postSrc": "http://it-ebooks.info/images/ebooks/10/algorithms_part_i_4th_edition.jpg",
    "datePublished": "2014",
    "numberOfPages": "490",
    "originDlLink": "http://filepi.com/i/I0TuoSu",
    "description": "This book is Part I of the fourth edition of Robert Sedgewick and Kevin Wayne's Algorithms, the leading textbook on algorithms today, widely used in colleges and universities worldwide. Part I contains Chapters 1 through 3 of the book. The fourth edition of Algorithms surveys the most important computer algorithms currently in use and provides a full treatment of data structures and algorithms for sorting, searching, graph processing, and string processing - including fifty algorithms every programmer should know. In this edition, new Java implementations are written in an accessible modular programming style, where all of the code is exposed to the reader and ready to use.",
    "originPageLink": "http://it-ebooks.info/book/3669",
    "index": 3669,
    "customBookName": "Algorithms",
    "createTime": 1447145248552
  },
  {
    "bookName": "Algorithms: Part II, 4th Edition",
    "postSrc": "http://it-ebooks.info/images/ebooks/10/algorithms_part_ii_4th_edition.jpg",
    "datePublished": "2014",
    "numberOfPages": "950",
    "originDlLink": "http://filepi.com/i/VCA4Nq9",
    "description": "This book is Part II of the fourth edition of Robert Sedgewick and Kevin Wayne's Algorithms, the leading textbook on algorithms today, widely used in colleges and universities worldwide. Part II contains Chapters 4 through 6 of the book. The fourth edition of Algorithms surveys the most important computer algorithms currently in use and provides a full treatment of data structures and algorithms for sorting, searching, graph processing, and string processing - including fifty algorithms every programmer should know. In this edition, new Java implementations are written in an accessible modular programming style, where all of the code is exposed to the reader and ready to use.",
    "originPageLink": "http://it-ebooks.info/book/3670",
    "index": 3670,
    "customBookName": "Algorithms2",
    "createTime": 1447145248809
  }
]